[
  {
    "pregunta": "¿Seré rico algún día?",
    "respuesta": "El Oráculo ve que el dinero llegará a tus manos, pero cuidado: así como entra, saldrá si no aprendes a retenerlo. La fortuna es una puerta que gira.",
    "categoria": "Dinero"
  },
  {
    "pregunta": "¿Ganaré la lotería?",
    "respuesta": "Las estrellas no muestran un camino fácil hacia el azar. Tu verdadera ganancia vendrá de un esfuerzo que hoy te parece pequeño, pero que crecerá con el tiempo.",
    "categoria": "Dinero"
  },
  {
    "pregunta": "¿Mejorarán mis finanzas?",
    "respuesta": "Habrá estabilidad, pero no lujo inmediato. Veo que tendrás que sacrificar un capricho presente para asegurar un bienestar futuro. La elección es tuya.",
    "categoria": "Dinero"
  },
  {
    "pregunta": "¿Encontraré el amor de mi vida?",
    "respuesta": "Alguien llegará, pero no será como en las películas. El amor real tiene arrugas y días difíciles. Prepárate para aceptar a alguien con sus defectos, no solo con sus luces.",
    "categoria": "Amor"
  },
  {
    "pregunta": "¿Me voy a casar?",
    "respuesta": "Veo un compromiso, pero las raíces deben ser fuertes. No te apresures por miedo a la soledad; el tiempo del Oráculo es distinto al reloj de los hombres.",
    "categoria": "Amor"
  },
  {
    "pregunta": "¿Le gusto a mi crush?",
    "respuesta": "Hay una conexión, pero es frágil. Si esperas a que el destino lo haga todo, la llama se apagará. A veces el universo necesita que tú des el primer paso.",
    "categoria": "Amor"
  },
  {
    "pregunta": "¿Tendré éxito en mi trabajo?",
    "respuesta": "El éxito vendrá, pero el precio será tu tiempo libre. Tendrás que decidir si la cima de la montaña vale la pena por la soledad que se siente al llegar.",
    "categoria": "Trabajo"
  },
  {
    "pregunta": "¿Me van a ascender?",
    "respuesta": "Tu nombre está en las conversaciones de los superiores, pero hay competencia cerca. No bajes la guardia ahora; el reconocimiento está en juego.",
    "categoria": "Trabajo"
  },
  {
    "pregunta": "¿Debo renunciar a mi empleo?",
    "respuesta": "El Oráculo ve un camino fuera de tu oficina, pero es un camino empedrado. Si te vas ahora, será difícil al principio. Asegúrate de tener provisiones antes de saltar.",
    "categoria": "Trabajo"
  },
  {
    "pregunta": "¿Debería hacerme un cambio de look?",
    "respuesta": "Un cambio puede renovarte, pero no cambiará quién eres por dentro. Prueba algo nuevo, pero no te escondas detrás de una máscara que no te pertenece.",
    "categoria": "Belleza"
  },
  {
    "pregunta": "¿Soy guapo o guapa?",
    "respuesta": "La belleza es un espejo que cambia con los años. El Oráculo ve que tu atractivo crece cuando dejas de compararte con los demás y aceptas tu propia rareza.",
    "categoria": "Belleza"
  },
  {
    "pregunta": "¿Qué piensa la gente de mi estilo?",
    "respuesta": "Algunos admiran tu audacia, otros no lo entienden. No puedes gustar a todo el mundo sin volverte invisible. Elige ser tú mismo, aunque incomodes.",
    "categoria": "Belleza"
  },
  {
    "pregunta": "¿Voy a vivir muchos años?",
    "respuesta": "Tu hilo de la vida es largo, pero se ve desgastado en algunas partes. No cuentes los años, haz que los años cuenten. Tu cuerpo es tu único vehículo, trátalo con respeto.",
    "categoria": "Salud"
  },
  {
    "pregunta": "¿Cómo estará mi salud?",
    "respuesta": "El Oráculo ve nubarrones que se disipan si actúas pronto. No ignores las señales pequeñas de tu cuerpo; a veces el susurro se convierte en grito.",
    "categoria": "Salud"
  },
  {
    "pregunta": "¿Debería empezar la dieta?",
    "respuesta": "La disciplina es amarga, pero su fruto es dulce. No busques milagros en una semana; el cambio real es lento, silencioso y requiere voluntad de hierro.",
    "categoria": "Salud"
  }
]
